git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-26 Tue 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Git Note</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hyungbo Shim" />
</head>
<body>
<div id="content">
<h1 class="title">My Git Note</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5cc92a5">1. init</a></li>
<li><a href="#orgdeefb49">2. config</a></li>
<li><a href="#org0eed308">3. status</a></li>
<li><a href="#org27a58b1">4. log</a></li>
<li><a href="#org692906c">5. add: working tree -&gt; staging area</a></li>
<li><a href="#org388fb07">6. rm: remove from both working tree and the staging area</a></li>
<li><a href="#org187b97c">7. commit: staging area -&gt; history</a></li>
<li><a href="#org811a558">8. add+commit: working tree -&gt; staging area and history</a></li>
<li><a href="#org755c92c">9. diff: working tree &lt;-&gt; staging area</a></li>
<li><a href="#org80eb788">10. diff: staging area &lt;-&gt; history</a></li>
<li><a href="#org97c4137">11. checkout: working tree &lt;- staging area</a></li>
<li><a href="#org16a6147">12. checkout: working tree and staging area &lt;- history</a></li>
<li><a href="#org02d68ae">13. checkout branch</a></li>
<li><a href="#org9b143f0">14. reset: staging area &lt;- history</a></li>
<li><a href="#org74b22b4">15. .gitignore</a></li>
<li><a href="#org5e72933">16. branch: list</a></li>
<li><a href="#orgdda2a61">17. branch: create new</a></li>
<li><a href="#org20f5b2b">18. branch: remove</a></li>
<li><a href="#orgf9ce9b5">19. merge: HEAD -&gt; master</a></li>
<li><a href="#org8dc305d">20. stash: save</a></li>
<li><a href="#org3825954">21. stash: list</a></li>
<li><a href="#org224ef9f">22. stash: apply</a></li>
<li><a href="#org6bec609">23. clone</a></li>
<li><a href="#org6cb335c">24. remote: add/remove</a></li>
<li><a href="#org4d63408">25. remote: list</a></li>
<li><a href="#org1650e07">26. fetch: local repository &lt;- remote repository</a></li>
<li><a href="#org33f832a">27. push: local repository -&gt; remote repository</a></li>
<li><a href="#org497d296">28. rebase</a></li>
<li><a href="#orgf47dd88">29. cherry-pick</a></li>
<li><a href="#orge17f911">30. template</a></li>
</ul>
</div>
</div>
<p>
Basics:
</p>

<ul class="org-ul">
<li><code>HEAD</code> is the pointer to the <span class="underline">working tree</span></li>
<li><code>master</code> is the pointer to the <span class="underline">local master branch</span></li>
<li><code>detached HEAD</code> is the situation where <code>HEAD</code> (current env) is not <code>master</code></li>
<li><code>WIP</code> means <span class="underline">Work In Progress</span> (stashing)</li>
<li><code>origin</code> short name for the location of the remote</li>
<li><code>origin/master</code> is called the <span class="underline">remote tracking branch</span> (what the master branch looks like at <code>origin</code>)</li>
<li><code>upstream</code>: let A be a repository, B a fork of A, C a local clone of B. Then A is called the <span class="underline">upstream</span></li>
<li><code>fetch</code> download remote to the local history</li>
<li><code>push</code> upload the local history to remote</li>
</ul>

<div id="outline-container-org5cc92a5" class="outline-2">
<h2 id="org5cc92a5"><span class="section-number-2">1</span> init</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-shell">git init
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdeefb49" class="outline-2">
<h2 id="orgdeefb49"><span class="section-number-2">2</span> config</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-shell">git config --global user.name <span style="color: #8b2252;">"&lt;NAME&gt;"</span>
git config -- global user.email <span style="color: #8b2252;">"<a href="mailto:NAME%40EMAIL.ADDRESS">&lt;NAME@EMAIL.ADDRESS&gt;</a>"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">git config --local user.name <span style="color: #8b2252;">"&lt;NAME&gt;"</span>
git config -- local user.email <span style="color: #8b2252;">"<a href="mailto:NAME%40EMAIL.ADDRESS">&lt;NAME@EMAIL.ADDRESS&gt;</a>"</span>
</pre>
</div>

<p>
To list config:
</p>
<div class="org-src-container">
<pre class="src src-shell">git config --list
</pre>
</div>
</div>
</div>

<div id="outline-container-org0eed308" class="outline-2">
<h2 id="org0eed308"><span class="section-number-2">3</span> status</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-shell">git status
</pre>
</div>
</div>
</div>

<div id="outline-container-org27a58b1" class="outline-2">
<h2 id="org27a58b1"><span class="section-number-2">4</span> log</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell">git log
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">git log -p
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">git log -- &lt;FILE&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">git log --all --decorate --oneline --graph
</pre>
</div>
<p>
It's convenient to alias this command
</p>
</div>
</div>

<div id="outline-container-org692906c" class="outline-2">
<h2 id="org692906c"><span class="section-number-2">5</span> add: working tree -&gt; staging area</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-shell">git add FILE
</pre>
</div>

<p>
<code>FILE</code> can be a list of files, <code>FILE1 FILE2 FILE3 ...</code>
we can use regexp, for eg, <code>S*</code> for all files starting with <code>S</code>
</p>

<p>
To add all modified files
</p>
<div class="org-src-container">
<pre class="src src-shell">git add .
</pre>
</div>
</div>
</div>

<div id="outline-container-org388fb07" class="outline-2">
<h2 id="org388fb07"><span class="section-number-2">6</span> rm: remove from both working tree and the staging area</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-shell">git rm &lt;FILE&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org187b97c" class="outline-2">
<h2 id="org187b97c"><span class="section-number-2">7</span> commit: staging area -&gt; history</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-shell">git commit
</pre>
</div>

<p>
To commit with a short commit message:
</p>
<div class="org-src-container">
<pre class="src src-shell">git commit -m <span style="color: #8b2252;">"&lt;SHORT COMMIT MESSAGE&gt;"</span>
</pre>
</div>

<p>
To commit without any commit message:
</p>
<div class="org-src-container">
<pre class="src src-shell">git commit --no-edit
</pre>
</div>

<p>
To amend the last commit:
</p>
<div class="org-src-container">
<pre class="src src-shell">git commit --amend
</pre>
</div>
<p>
(This does changes the ID of the last commit. Amending works only for the latest  commit.)
</p>

<p>
To commit without
</p>
</div>
</div>
<div id="outline-container-org811a558" class="outline-2">
<h2 id="org811a558"><span class="section-number-2">8</span> add+commit: working tree -&gt; staging area and history</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-shell">git commit -a
</pre>
</div>

<p>
nothing to specify after <code>git rm</code>
</p>
</div>
</div>

<div id="outline-container-org755c92c" class="outline-2">
<h2 id="org755c92c"><span class="section-number-2">9</span> diff: working tree &lt;-&gt; staging area</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-shell">git diff
</pre>
</div>
</div>
</div>

<div id="outline-container-org80eb788" class="outline-2">
<h2 id="org80eb788"><span class="section-number-2">10</span> diff: staging area &lt;-&gt; history</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-shell">git diff --staged
</pre>
</div>
</div>
</div>

<div id="outline-container-org97c4137" class="outline-2">
<h2 id="org97c4137"><span class="section-number-2">11</span> checkout: working tree &lt;- staging area</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-shell">git checkout -- &lt;FILE&gt;
</pre>
</div>

<p>
To place HEAD (i.e., to retrieve) to the state &lt;HASH&gt;:
</p>
<div class="org-src-container">
<pre class="src src-shell">git checkout &lt;HASH&gt;
</pre>
</div>

<p>
<code>&lt;HASH&gt;</code> can be the first five characters
</p>
</div>
</div>

<div id="outline-container-org16a6147" class="outline-2">
<h2 id="org16a6147"><span class="section-number-2">12</span> checkout: working tree and staging area &lt;- history</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-shell">git checkout &lt;HASH&gt; -- &lt;FILE&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org02d68ae" class="outline-2">
<h2 id="org02d68ae"><span class="section-number-2">13</span> checkout branch</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-shell">git chekout &lt;BRANCH NAME&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b143f0" class="outline-2">
<h2 id="org9b143f0"><span class="section-number-2">14</span> reset: staging area &lt;- history</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-shell">git reset HEAD &lt;FILE&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org74b22b4" class="outline-2">
<h2 id="org74b22b4"><span class="section-number-2">15</span> .gitignore</h2>
<div class="outline-text-2" id="text-15">
<p>
<code>.gitignore</code> lists of files that should be ignored. we can use regexp. a whole folder is indicated by <code>&lt;FOLDER&gt;/</code>
</p>
</div>
</div>

<div id="outline-container-org5e72933" class="outline-2">
<h2 id="org5e72933"><span class="section-number-2">16</span> branch: list</h2>
<div class="outline-text-2" id="text-16">
<p>
To list all branches:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch
</pre>
</div>

<p>
To list merged branches:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch --merged
</pre>
</div>

<p>
To list local and remote branches:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch -a
</pre>
</div>

<p>
To list remote tracking branches only:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch -r
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdda2a61" class="outline-2">
<h2 id="orgdda2a61"><span class="section-number-2">17</span> branch: create new</h2>
<div class="outline-text-2" id="text-17">
<p>
To create a new branch from HEAD:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch &lt;BRANCH NAME&gt;
</pre>
</div>

<p>
To create + checkout -&gt; new branch:
</p>
<div class="org-src-container">
<pre class="src src-shell">git branch -b &lt;BRANCH NAME&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org20f5b2b" class="outline-2">
<h2 id="org20f5b2b"><span class="section-number-2">18</span> branch: remove</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-shell">git branch -d &lt;BRANCH&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9ce9b5" class="outline-2">
<h2 id="orgf9ce9b5"><span class="section-number-2">19</span> merge: HEAD -&gt; master</h2>
<div class="outline-text-2" id="text-19">
<p>
To merge &lt;BRANCH&gt; into master:
</p>
<div class="org-src-container">
<pre class="src src-shell">git merge &lt;BRANCH&gt;
</pre>
</div>
<p>
The response can be different depending on the strategy:
</p>
<ul class="org-ul">
<li>fast-forward</li>
<li><p>
three-way (recursive)
</p>
<ul class="org-ul">
<li>In case of conflict, files with conflict get modified with diff contents. We can check and resolve these conflict by opening those files. When doing this, we also need to delete git markers.</li>
<li>After conflicts are resolved, do <code>git status</code>.</li>
<li>Aborting the merge process will restore the original file contents:</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">git merge --abort
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org8dc305d" class="outline-2">
<h2 id="org8dc305d"><span class="section-number-2">20</span> stash: save</h2>
<div class="outline-text-2" id="text-20">
<p>
To save working directory without staging:
</p>
<div class="org-src-container">
<pre class="src src-shell">git stash
</pre>
</div>

<p>
To stash with comment:
</p>
<div class="org-src-container">
<pre class="src src-shell">git stash save <span style="color: #8b2252;">"&lt;comment&gt;"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3825954" class="outline-2">
<h2 id="org3825954"><span class="section-number-2">21</span> stash: list</h2>
<div class="outline-text-2" id="text-21">
<p>
To list all stashes:
</p>
<div class="org-src-container">
<pre class="src src-shell">git stash list
</pre>
</div>

<p>
To list all stashes with changes:
</p>
<div class="org-src-container">
<pre class="src src-shell">git stash list -p
</pre>
</div>
</div>
</div>

<div id="outline-container-org224ef9f" class="outline-2">
<h2 id="org224ef9f"><span class="section-number-2">22</span> stash: apply</h2>
<div class="outline-text-2" id="text-22">
<div class="org-src-container">
<pre class="src src-shell">git stash apply
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">git stash apply &lt;LABEL&gt;
</pre>
</div>
<p>
Here, <code>&lt;LABEL&gt;</code> is the one given by <code>stash list</code>
</p>
</div>
</div>

<div id="outline-container-org6bec609" class="outline-2">
<h2 id="org6bec609"><span class="section-number-2">23</span> clone</h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">
<pre class="src src-shell">git clone git@github.com:name/git.git
</pre>
</div>
</div>
</div>

<div id="outline-container-org6cb335c" class="outline-2">
<h2 id="org6cb335c"><span class="section-number-2">24</span> remote: add/remove</h2>
<div class="outline-text-2" id="text-24">
<p>
To add a new remote:
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote add origin &lt;REMOTE REPOSITORY URL&gt;
</pre>
</div>


<p>
To add upstream:
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote add upstream &lt;UPSTREAM REPOSITORY URL&gt;
</pre>
</div>

<p>
To remove:
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote remove &lt;REMOTE NAME&gt;
</pre>
</div>

<p>
After modifying remote/upstream, run <code>git remote -v</code> to verify.
</p>
</div>
</div>

<div id="outline-container-org4d63408" class="outline-2">
<h2 id="org4d63408"><span class="section-number-2">25</span> remote: list</h2>
<div class="outline-text-2" id="text-25">
<p>
To list remotes (short names only):
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote
</pre>
</div>

<p>
To list remotes (short and full names only):
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote
</pre>
</div>

<p>
To list remotes verbosely:
</p>
<div class="org-src-container">
<pre class="src src-shell">git remote -v
</pre>
</div>
</div>
</div>

<div id="outline-container-org1650e07" class="outline-2">
<h2 id="org1650e07"><span class="section-number-2">26</span> fetch: local repository &lt;- remote repository</h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">
<pre class="src src-shell">git fetch origin
</pre>
</div>
<p>
Note that this does not affect local/HEAD. We need to merge, eg. <code>git merge origin/master</code> later.
</p>

<div class="org-src-container">
<pre class="src src-shell">git fetch upstream
</pre>
</div>

<p>
To fetch and merge:
</p>
<div class="org-src-container">
<pre class="src src-shell">git pull &lt;REMOTE_NAME&gt; &lt;LOCAL_BRANCH_NAME&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org33f832a" class="outline-2">
<h2 id="org33f832a"><span class="section-number-2">27</span> push: local repository -&gt; remote repository</h2>
<div class="outline-text-2" id="text-27">
<div class="org-src-container">
<pre class="src src-shell">git push &lt;REMOTE REPOSITORY: eg. origin&gt; &lt;LOCAL BRANCH: eg. master&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org497d296" class="outline-2">
<h2 id="org497d296"><span class="section-number-2">28</span> rebase</h2>
<div class="outline-text-2" id="text-28">
<p>
To "operate on" the last &lt;n&gt; commits back from HEAD:
</p>
<div class="org-src-container">
<pre class="src src-shell">git rebase -i HEAD~&lt;n&gt;
</pre>
</div>
<p>
(<code>-i</code> indicates "interactive".)
</p>

<p>
Interactive commands:
</p>
<ul class="org-ul">
<li><code>reword</code>: edit commit message</li>
<li><code>drop</code>: remove commit</li>
</ul>
<p>
We can also reorder commits by changing the order of the lines.
</p>
</div>
</div>

<div id="outline-container-orgf47dd88" class="outline-2">
<h2 id="orgf47dd88"><span class="section-number-2">29</span> cherry-pick</h2>
</div>

<div id="outline-container-orge17f911" class="outline-2">
<h2 id="orge17f911"><span class="section-number-2">30</span> template</h2>
<div class="outline-text-2" id="text-30">
<div class="org-src-container">
<pre class="src src-shell">
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Tue May 26 12:21:12 2020</p>
<p class="author">Author: Hyungbo Shim</p>
<p class="date">Created: 2020-05-26 Tue 15:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
